<template>
  <div>
    <div class="sBanner sBanner-s1">
      <p class="bannerTitle-right">行业解决方案</p>
    </div>
    <div class="">
      <div class="manufacturer">
        <p class="indexTitle">行业解决方案</p>
        <el-tabs v-model="tabPosition" type="card">
          <el-tab-pane v-for="(item, index) in solutionCase" :key="'solution' + index" :label="item.label" :name="index + ''">
            <el-card shadow="always" class="solutionCase">
              <p class="title">{{ item.p }}</p>
              <p>{{ item.span }}</p>
            </el-card>
          </el-tab-pane>
        </el-tabs>
        <!-- <el-radio-group v-model="tabPosition">
          <el-radio-button label="1">新零售</el-radio-button>
          <el-radio-button label="2">金融</el-radio-button>
          <el-radio-button label="3">数字政府</el-radio-button>
          <el-radio-button label="4">物流交通</el-radio-button>
          <el-radio-button label="5">教育</el-radio-button>
          <el-radio-button label="6">制造</el-radio-button>
          <el-radio-button label="7">医疗</el-radio-button>
          <el-radio-button label="8">文旅</el-radio-button>
          <el-radio-button label="9">地产</el-radio-button>
        </el-radio-group> -->
      </div>
    </div>
    <div class="bg-gray">
      <div class="manufacturer">
        <p class="indexTitle">先进技术案例</p>
        <el-radio-group v-model="tabPosition2">
          <el-radio-button label="1">区块链</el-radio-button>
          <el-radio-button label="2">数字身份</el-radio-button>
          <el-radio-button label="3">边缘计算</el-radio-button>
        </el-radio-group>
        <el-row :gutter="30">
          <el-col :span="12" v-for="(item, index) in commonSolution" :key="index">
            <el-card shadow="always" class="solutionList commonSolution">
              <p class="title">{{ item.name }}</p>
              <p>{{ item.description }}</p>
            </el-card>
          </el-col>
        </el-row>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: "SolutionCase",
  data() {
    return {
      tabPosition: 0,
      tabPosition2: 1,
      // industrySolution: [
      //   {
      //     name: '应收账款流转',
      //     description: '将核心企业应付账款债权进行多级流转、拆分；为大量无法融资的中小企业、商业机构提供更多的融资机会，降低了中小企业的资金成本，解决企业三角债困局。',
      //   },
      //   {
      //     name: '动产质押',
      //     description: '运用“人工智能+区块链+物联网”三者结合技术，为用户提供区块链资产管理服务，以满足基于动产质押的供应链金融及大宗商品电子仓单交易等场景。',
      //   },
      //   {
      //     name: '数字身份',
      //     description: '基于联盟链的实体身份标识DID技术解决方案，提供分布式实体身份标识与管理、交换可信数据，促进跨地域、跨部门的身份认证和数据合作。',
      //   },
      //   {
      //     name: '可信数据共享',
      //     description: '采用区块链技术连接数据建模服务方、监管方、使用方和提供方等，实现身份数据目录与授权、数据、密文数据共享和交换等链上操作。',
      //   },
      // ],
      commonSolution: [
        {
          name: "全球网络互联",
          description:
            "通过云际全球核心网络、云原生SD-WAN技术，保障企业核心业务在全球范围的高品质互联，帮助客户构建企业专属的全球一张网。全球网络互联提供了高弹性、高私密、高质量的网络能力，并适配了移动端、本地DC、本地分支等丰富的网络接入场景，便于全球客户随时随地接入云际。"
        },
        {
          name: "企业级云上网络",
          description:
            "伴随越来越多的企业用户上云，如何构建一个符合企业管理要求的可管可控式云网络环境，成为企业上云过程中必须解决的问题之一。企业级云上网络方案利用负载均衡SLB、专有网络VPC等网络产品，帮助企业构建一套支持多业务部署、高安全、可靠性强的云上网络。"
        },
        {
          name: "全球应用加速",
          description:
            "面向各行各业应用场景，提供一站式加速网络和应用，提升网络性能，确保应用安全。 云际的智能广域网基础设施服务遍及全球，采用集中式 IT 管理，控制企业间的网络连接，实现网络服务跨地域部署和全球范围就近接入，提升服务可用性和性能；方案中为客户提供了不同场景下的网络应用安全加速建议。"
        },
        {
          name: "SD_WAN解决方案",
          description:
            "基于云际厂商优质的全球传输网络，通过SDN技术应用到广域网络，结合智能接入网关，企业分支及企业总部实现就近接入云际POP点，帮助企业快速、安全、简单地构建广域互联网络，为用户提供了一站式云-网-端的云原生SD-WAN解决方案。"
        },
        {
          name: "IPv6解决方案",
          description:
            "方案助力企业将网络快速升级到IPv6基础架构，针对电子政务、企业官网、应用商店审核、广电传媒等多行业和多场景，提供丰富可选的产品和可靠安全的体验服务。"
        },
        {
          name: "云网络解决方案",
          description:
            "面向全球网络互联和企业全面上云需求，打造全球互联网络、企业级云上网络、云原生应用网络和应用加速网络四大核心解决方案及丰富的产品和功能，助力企业数字化转型。"
        }
      ],
      solutionCase: [
        {
          label: "智能制造",
          p: ` 智能制造是一个柔性系统，能够自主学习适应新环境，自动运行整个生产流程，强化制造企业的数据洞察能力，实现智能化控制和管理，是现代工业制造信息化发展的新阶段。
    智能制造指基于泛在感知技术，实现面向产品生产全生命周期的信息化和智能化的生产制造，是在传感技术、通信技术、自动控制、人工智能等创新技术基础上，通过智能化的感知、交互、决策和执行技术，实现设计、制造以及服务的智能化，是通信技术、信息技术与制造技术的深度融合和创新集成。
`,
          span: `
1、智能监控：
结合感知传感器、定位摄像等技术，降低有线部署和人工值守的成本，实现降低成本、高可靠的智能化监控。
2、自动化生产：
通过搭建智能工厂神经中枢，结合DCS智能化控制系统，建立生产调度中心。
3、智能检测：
在质量检测过程中，通过工业相机实时采集产品图像信息，提升质量检测的准确率、检测效率和监测范围。`
        },
        {
          label: "智慧农业",
          p: ` 智慧农业是农业信息化发展到智能化的高级阶段，是以信息和知识为核心要素，通过将互联网、物联网、大数据、云计算、人工智能等现代信息技术与农业深度融合，实现农业信息感知、定量决策、智能控制、精准投入、个性化服务的全新的农业生产方式。
    智慧农业的生态场景围绕生产、服务和生活展开，涉及从投入到产出全产业链的各个领域、各个环节。智慧农业利用先进的数字化、信息化手段，达到科学化、精准化、精细化、生态化、灵活化的效果和目标，囊括了通过智能智慧技术实现高附加值农产品价值创造、价值实现和价值服务的全过程。`,
          span: `1、大田智慧农业：
应对生产环境的不可控因素，借助智慧技术、科技装备进行农业生产的趋利避害。
2、设施智慧农业：
设施智慧农业是生产条件和生产环境可控的智慧农业形态，由于作业环境可控性好、可塑性强，设施智慧农业可具有更高的智能水平。
3、智慧养殖业：
智慧养殖业包含智慧畜牧养殖和智慧水产养殖。借助智能科技实时监控动植物健康环境，事项综合养殖效益最大化。
4、智慧农技服务业：
智慧智能科技在农业的集中信息化应用，是促进智慧农业发展的关键路径。
5、智慧农业监管服务：
智慧农业监管服务是农业监管服务的一体化、耦合化、智能化整合升级，是农业支持保护体系的系统化、立体化、智慧化实现。`
        },
        {
          label: "智慧城市",
          p: `智慧城市是新一代信息通信技术与城市经济社会发展深度融合，促进城市规划、建设、管理和服务智慧化的新理念和新模式，也是物理世界与数字世界相互映射、协同交互的城市新形态。
    智慧城市由物理设施（建筑、市政工程、公用设施等）、数字空间（通信、算力、数据、算法等）和社会人文生态组成，运用通信、连接、数据、智能等技术手段，实现对城市实时动态的感知、分析、协调，并能对城市治理和公共服务等作出智能响应，实现城市健康运行和可持续发展。
`,
          span: `1、单领域融合：
打破城市的物理空间界限，延伸城市服务边界。打造万物互联，数据流通，全栈智能加速城市要素的数字化和城市业务的智能化。
2、虚拟现实结合：
物理城市和虚拟数字城市的互相映射和协同交互，形成真正意义上的“数字孪生体”。
3、多领域融合：
智慧城市建设通过业务融合、技术融合和数据融合，支撑城市从单领域智能到城市智群的升级。实现跨层级、跨系统、跨地区、跨业务的协同管理和服务。`
        },
        {
          label: "智能交通",
          p: `智能交通涉及汽车、电子、信息通信、交通运输和交通管理等多个行业，借助于“人一车一路一云”交通参与要素之间的有效连接和信息交互，不仅可以促进信息通信技术在跨行业领域的应用推广，还有助于加强汽车、交通等传统产业的智能化网联化转型，并逐步培育出新的产业生态。
`,
          span: `1、车路协同应用架构
感知、连接和计算是车路协同的基本要素。车路协同应用架构由“端一管一边一云”组成。端即网络层、管即网络层、云即平台管理和应用层、边即多接入边缘计算。
2、智能交通关键技术
智能交通关键技术基于上述车路协同应用架构，智能 RSU、多接入边缘计算及分级架构、5G网络切片、人工智能及大数据、高精度定位以及高精地图等关键技术有效协同，支持智能交通系统持续发展和演进。
`
        },
        {
          label: "智能电网",
          p: `智能电网是在传统电力系统基础上，通过集成先进信息技术、控制技术、储能技术等，以坚强网络架构为基础、以信息通信平台为支撑、以智能控制为手段，包括电力系统的发电、输电、变电、配电、用电和调度各个环节，覆盖所有电压等级，实现电力流、信息流、业务流高度一体化融合，具有坚强可靠、经济高效、清洁环保、透明开放、友好互动的特征。
智能电网是一个完全自动化的供电网络，其中的每一个用户和节点都得到实时监控，并保证从发电厂到用户端之间整个输配电过程中所有节点之间的电流和信息双向流动。智能电网通过广泛应用的分布式智能和宽带通信，以及自动控制系统、智能化决策系统的集成，提高供电可靠水平，实现“源一网一荷－储”一体化，支撑能源清洁化转型和电力市场化改革。
`,
          span: `1智慧输变电场景生态：
基于云计算和边缘计算平台搭建总部一换流站/变电站两级的输变电设备状态集中监测中心，实现输电线路状态和全寿命周期管理。
2智能配电网场景生态：
通过物联网技术应用，实现分布式能源、储能、充电设备的接入和双向交互，提升供电可靠性与用电效率以及为节能减排提供技术保证。
3智慧电力服务场景生态：
通过人工智能、地理位置服务和移动应用技术，实现办电用户身份验证、面对面办电指导、安全缴费、线上智能客服等功能，提高办电效率和安全性，进一步提升用户体验。
`
        },
        {
          label: "智慧金融",
          p: `金融是现代经济的核心，金融服务行业一直是创新的积极实践者和受益者，我国金融服务行业在全面信息化建设浪潮中处于前列，在5G网络、数据中心、云计算、人工智能等新型基础设施日趋成熟、高度融合之下，“智慧金融”成为金融服务演进的方向，以更加高效、安全、定制化的服务，体现在金融全链条运行当中。与此同时，“智慧金融”与智慧城市、智慧农业、智慧交通等业态日益交融，形成智慧金融生态圈，为金融行业自身提供转型驱动力，进一步实现“以智促惠”， 更加精准、灵活、广泛地实现资源配置，让资金融通这一基础性功能更“聪明”地作用于传统产业转型升级，服务于实体经济高质量发展，普惠于社会民生各领域。
`,
          span: `1智能支付快速发展
移动支付是支付体系的重要蜕变，使用户能够随时随地获取所需服务并完成支付过程。
2银行服务的数字化转型
“开放式银行”以开放API为基础，以数据共享为本质，以平台合作为模式，以数字化信息新型基础设施建设为基础支撑，实现更高效、更低成本、更优体验的客户需求。
3保险行业智能应用
保险行业在新型基础设施的助力下形成无边界、高融合的开放生态新业态和新生态，充分发挥其风险保障属性，为经济社会的发展提供更多的风险保障和服务作用。
4资本市场智能化发展
伴随着新型基础设施领域不断建设和战略投入，未来云计算领域会形成更加完备、垂直、精细化的运营服务格局。
5智能风控
智能风控是在数据驱动下提升风控与运营水平，金融科技的普及为智能风控提供了扎实的技术支撑，广泛应用于支付清算、信贷融资、保险理赔等各个场景中。
`
        },
        {
          label: "智慧物流",
          p: `物流作为当代社会重要组成部分，在国民经济和社会发展中发挥着重要作用。智慧物流深嵌产业的制造与销售流程，有助于提升各产业的经济与社会效益，实现物流驱动产业升级，形成物流与产业互动的新局面，对优化资源配置、促进经济发展具有积极推动作用。
    智慧物流包含物联网、云计算、大数据等新型信息技术和智能设备设施等科技要素，通过高效的执行、运营与决策等领域智能化能力，实现物流作业自动化、物流管理与流程的可视化、物流规划与决策的智能化，最终达到提升物流运营效率、提高服务质量和降低用工成本的目的。
`,
          span: `1、智能规划
智能规划通过数据智能技术的引进，能够在规划层满足物流业务战略的同时，系统性降低物流网络的成本，物流网络规划是面向中长期的战略性规划。
2、数字化管理
智慧物流在运营层面体现为数字化管理方式，其核心承载是物流管理系统。通过该系统，保障整个物流体系的有效运营。
3、自动化作业
在物流执行层面应用物流自动化及智能化技术和相关智能设备实现作业的强体验、高效率、低成本，是行业持续探索的方向。在智慧物流体系中，互联互通、自主控制的智能设施设备是自动化、智能化作业的关键。
`
        },
        {
          label: "智慧教育",
          p: `迈入数字时代，教育领域信息化的脚步不断加快，以智慧教育为核心的各类应用场景不断以新的模式出现，带来了教育形式和学习方式的重大改变。
    智慧教育是运用5G、物联网、人工智能、大数据、云计算、区块链等新技术新手段，形成智慧学习环境支撑，通过信息技术与教育主流业务的深度融合（智慧教学、智慧学习、智慧管理、智慧评价、智慧科研和智慧服务）， 让教师能够施展高成效的教学方法，让学习者能够进行泛在学习、个性化学习，获得美好个人发展体验的一种应用场景。
`,
          span: `1、智慧教学
智慧教学是教师在智慧教学环境下，利用各种先进信息化技术和丰富的教学资源开展的教学活动。通过智慧备课、智慧课堂、智慧阅卷／作业等形式改变传统的教学模式。
2、智慧学习
智慧学习的核心目标是促进学习者个性化的发展，为学习者提供虚拟的智慧学习环境。通过建立以连接课堂与社区、家庭及校园为重要载体的网络学习空间来支持互帮互助、协作交流的学习共同体建设，形成不同学习场景的无缝衔接。
3、智慧管理
智慧管理辅助各级教育管理部门和管理人员提升教育管理的智能水平。促进校园管理和区域教育治理的精细管理、科学化决策、可视化管控和可信性评价。
4、智慧评价
智慧评价基于新一代信息技术，实现针对教学、教师、学生的全方位、全过程、动态化、客观真实评价。通过大数据技术建立多元、多维、多指标的评价模型，对教育评价数据进行深度挖掘分析形成评价数据报告，将信息技术和智能技术深度融入教育教学评估全过程。
5、智慧教育教研
网络协同教研。建立基于5G 网络和大数据教学资源管理和教师在线协同教研平台，使教学研究活动从传统线下研讨向在线化互动方向转型，提升教学教研质量，促进教师专业发展；通过组建教研网络共同体，促进教学教研成果的快速流通、转换和分享。
6、智慧教育服务
智慧服务构建以服务客体为中心的服务平台，使用大数据、虚拟化、物联网、人工智能等新技术为用户个性化场景落地提供支撑。
7智慧教育环境
智慧环境是智慧教育的物理基础，由智慧教育云、教育承载网和智慧校园三部分组成。`
        },
        {
          label: "智慧医疗",
          p: `智慧医疗是以“人民群众医疗健康”为核心导向，结合5G、物联网、云计算、大数据、人工智能等新型基础设施建设核心技术，通过构建全场景、全周期、智能化的数字生态，加速优化医疗资源配置并提升医疗效率，推动医疗健康服务模式创新与运营体制创新，构建智慧医疗服务、智能健康管理、智慧公共卫生等领域应用，覆盖个体全生命周期，涵盖预防、治疗、康复、养老等线上线下一体化医疗健康服务新模式。  
`,
          span: `1智慧医疗服务
随着5G的大规模商用，国内一大批医疗机构基于5G网络开展院间医疗合作、院内医疗设备互联互通和院外应急救治等应用，先后在5G智慧救援、远程会诊、远程手术、移动医护、VR隔离探视和医院物资管理等方面，展开智慧医疗的应用创新。
2智慧健康管理
基于个体健康风险因素，提供智能化健康干预管理。具体应用如：运动管理、风险预测、居家护理、远程监测、健康管理及健康养老等。
3智慧公共卫生
整合区域医疗卫生信息资源，预测疾病流行趋势，加强对传染病等疾病的智能监测，提高重大疾病防控和突发公共卫生事件应对能力。具体应用如：传染病智能预警、医疗质量智能监管、环境卫生智慧监测及灾害防病智能预警等。
`
        },
        {
          label: "智慧文旅",
          p: `智慧文旅是指以特色文化为内在驱动，以现代科技为主要手段，通过5G、大数据、物联网、人工智能等新一代信息技术实现“文化+旅游+科技”融合，围绕旅游管理、旅游服务、旅游营销、旅游信息传播、旅游体验等智慧化应用所形成的数字化文化旅游新产业。
    智慧文旅的建设与发展体现在一是面向消费者的创新文旅体验和消费服务的智慧化。二是面向企业的文旅服务和产品的智慧化。三是面向政务和行业管理的智慧化。
`,
          span: `1智慧文旅体验
面向消费者的创新文旅体验和消费服务的智慧化，即TOC业务，推动文化旅游资源与多样化、个性化市场需求的高效对接，实现精准的线上线下无缝服务和深度文化体验等实时、互动、个性化服务，大大提升了用户体验，推动传统的旅游观光消费方式向现代文化旅游体验消费方式转变。
2智慧文旅服务
面向企业的文旅服务和产品的智慧化，即TO B业务，包括智慧移动出行、智慧住宿、智慧导游、智慧景区、智慧游乐、智慧文娱、智慧文博、虚拟旅游，OTA (在线旅游）个性化在线定制、大数据精准营销等全方位的服务。
3智慧文旅管理
面向政府和行业管理的智慧化，即TOG业务。包括景区动态监测、信息监管、大数据统计分析、景区人流引导、安全预警等内容，全面了解行业和谢各需求、旅游目的地动态、投诉建等内容，推动传统旅游管理方式向现代管理方式转变，实现政府的科学决策和管理。
`
        }
      ]
    };
  },
  methods: {}
};
</script>
<style lang="scss" scoped>
.solutionCase {
  p {
    line-height: 1.8rem;
  }
  .title {
    text-indent: 2rem;
  }
}
</style>
